In [6]:
import pandas as pd
import numpy as np

##### SERIES

In [7]:
s = pd.Series([45,22,17,5,33,16,85])

In [3]:
s

0    45
1    22
2    17
3     5
4    33
5    16
6    85
dtype: int64

In [4]:
s[4] = 99
s

0    45
1    22
2    17
3     5
4    99
5    16
6    85
dtype: int64

In [15]:
s= pd.Series([45,22,17,5,33,16,85], dtype=np.int8)

In [16]:
s

0    45
1    22
2    17
3     5
4    33
5    16
6    85
dtype: int8

In [18]:
s[4] = 99

In [19]:
s

0    45
1    22
2    17
3     5
4    99
5    16
6    85
dtype: int8

In [20]:
type(s)

pandas.core.series.Series

In [21]:
s.dtype

dtype('int8')

In [22]:
s.size

7

In [23]:
s.values

array([45, 22, 17,  5, 99, 16, 85], dtype=int8)

##### DATAfRAME

In [11]:
r = pd.Series([1,2,3,4,5,])
n = pd.Series(['nitin', 'rajan', 'rani', 'priya', 'manoj'])
m = pd.Series([56.78, 76.23, 67.89, 77.45, 71.34])

In [12]:
df = pd.DataFrame({
    'roll': r,
    'name': n,
    'marks': m
    })

In [13]:
df

   roll   name  marks
0     1  nitin  56.78
1     2  rajan  76.23
2     3   rani  67.89
3     4  priya  77.45
4     5  manoj  71.34

In [24]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

In [25]:
type(df)

pandas.core.frame.DataFrame

In [26]:
df.shape # no of rows and colums

(5, 3)

In [27]:
df.size # total no of elements in the table

15

##### Handling Actual Data  DATASET

In [28]:
# https://mitu.co.in/dataset
# Download all the flies whose name starts with students*
# Store in current working directory in folder datasets/

##### LOAD THE DATA

In [33]:
df = pd.read_csv('dataset/student.csv')

In [34]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [35]:
type(df)

pandas.core.frame.DataFrame

In [36]:
df1 = pd.read_csv('dataset/student1.csv')

In [37]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [40]:
 df1 = pd.read_csv('dataset/student1.csv', names=['A', 'B', 'C', 'D', 'E'])

In [41]:
df1

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [43]:
None

In [45]:
 df1 = pd.read_csv('dataset/student1.csv', names=None)

In [46]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [47]:
 df1 = pd.read_csv('dataset/student1.csv', header=None)

In [48]:
df1

    0        1   2      3   4
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [51]:
 df3 = pd.read_csv('dataset/student3.tsv')

In [52]:
df3

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [54]:
df3 = pd.read_csv('dataset/student3.tsv', sep='\t')
df3

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [57]:
df2 = pd.read_csv('https://raw.githubusercontent.com/mwaskom/seaborn-data/master/iris.csv')

In [58]:
df2

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

##### ACCESS DATA INFORMATION

In [59]:
df.shape

(10, 5)

In [60]:
df.size

50

In [61]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [65]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [66]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [67]:
df.values

array([[1, 'anil', 'TE', 56.77, 22],
       [2, 'amit', 'TE', 59.77, 21],
       [3, 'aniket', 'BE', 76.88, 19],
       [4, 'ajinkya', 'TE', 69.66, 20],
       [5, 'asha', 'TE', 63.28, 20],
       [6, 'ayesha', 'BE', 49.55, 20],
       [7, 'amar', 'BE', 65.34, 19],
       [8, 'amita', 'BE', 68.33, 23],
       [9, 'amol', 'TE', 56.75, 20],
       [10, 'anmol', 'BE', 78.66, 21]], dtype=object)

In [68]:
df.T

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

In [69]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [70]:
df.head(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [73]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [74]:
df.tail(3)

   roll   name class  marks  age
7     8  amita    BE  68.33   23
8     9   amol    TE  56.75   20
9    10  anmol    BE  78.66   21

##### INDEX BASE SLICING

In [76]:
X = df.iloc[2:8,1:4]
X

      name class  marks
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33

In [77]:
X = df.iloc[4:8,1:4]
X

     name class  marks
4    asha    TE  63.28
5  ayesha    BE  49.55
6    amar    BE  65.34
7   amita    BE  68.33

In [78]:
X = df.iloc[:8,1:4]
X

      name class  marks
0     anil    TE  56.77
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33

In [80]:
X = df.iloc[2:,1:]
X

      name class  marks  age
2   aniket    BE  76.88   19
3  ajinkya    TE  69.66   20
4     asha    TE  63.28   20
5   ayesha    BE  49.55   20
6     amar    BE  65.34   19
7    amita    BE  68.33   23
8     amol    TE  56.75   20
9    anmol    BE  78.66   21

In [84]:
X = df.iloc[1:,1:]
X

      name class  marks  age
1     amit    TE  59.77   21
2   aniket    BE  76.88   19
3  ajinkya    TE  69.66   20
4     asha    TE  63.28   20
5   ayesha    BE  49.55   20
6     amar    BE  65.34   19
7    amita    BE  68.33   23
8     amol    TE  56.75   20
9    anmol    BE  78.66   21

In [88]:
df.iloc[[3,7,5,9],:]

   roll     name class  marks  age
3     4  ajinkya    TE  69.66   20
7     8    amita    BE  68.33   23
5     6   ayesha    BE  49.55   20
9    10    anmol    BE  78.66   21

In [92]:
df.iloc[[3,7,5,9],:3]

   roll     name class
3     4  ajinkya    TE
7     8    amita    BE
5     6   ayesha    BE
9    10    anmol    BE

In [93]:
df.iloc[4,:]

roll         5
name      asha
class       TE
marks    63.28
age         20
Name: 4, dtype: object

In [94]:
df.iloc[:,1]

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [96]:
df.iloc[:,3]

0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
6    65.34
7    68.33
8    56.75
9    78.66
Name: marks, dtype: float64

In [97]:
df.iloc[3,1]

'ajinkya'

##### Label Based Slicing

In [103]:
df.iloc[:,2:3]

  class
0    TE
1    TE
2    BE
3    TE
4    TE
5    BE
6    BE
7    BE
8    TE
9    BE

In [114]:
df.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [109]:
df[['name', 'marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [110]:
df.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [113]:
df.name.values

array(['anil', 'amit', 'aniket', 'ajinkya', 'asha', 'ayesha', 'amar',
       'amita', 'amol', 'anmol'], dtype=object)

In [121]:
df.drop(5)  # This function is used for droping a row in the table

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [120]:
df.drop([3,4,5])

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [124]:
df.drop('class', axis = 1)

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [146]:
df.drop(['class','age'], axis = 1)

KeyError: "['class', 'age'] not found in axis"

In [127]:
df.

(10, 5)

In [128]:
df.drop(['class','age'], axis = 1, inplace=True)

In [129]:
df.shape

(10, 3)

In [130]:
df

   roll     name  marks
0     1     anil  56.77
1     2     amit  59.77
2     3   aniket  76.88
3     4  ajinkya  69.66
4     5     asha  63.28
5     6   ayesha  49.55
6     7     amar  65.34
7     8    amita  68.33
8     9     amol  56.75
9    10    anmol  78.66

In [154]:
df = pd.read_csv('dataset/student.csv')

In [155]:
df.drop(['class','age'], axis = 1)

   roll     name  marks
0     1     anil  56.77
1     2     amit  59.77
2     3   aniket  76.88
3     4  ajinkya  69.66
4     5     asha  63.28
5     6   ayesha  49.55
6     7     amar  65.34
7     8    amita  68.33
8     9     amol  56.75
9    10    anmol  78.66

In [156]:
df['marks'].min()

49.55

In [157]:
df['marks'].mean()

64.499

In [158]:
df['marks'].median()

64.31

In [159]:
df['marks'].sum()

644.9899999999999

In [160]:
df['marks'].std()

9.207178901994535

In [161]:
df.count()

roll     10
name     10
class    10
marks    10
age      10
dtype: int64

In [162]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [163]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

In [164]:
df.max()

roll         10
name     ayesha
class        TE
marks     78.66
age          23
dtype: object

In [165]:
df.sum(numeric_only=True)

roll      55.00
marks    644.99
age      205.00
dtype: float64

In [166]:
df.sum()

roll                                                    55
name     anilamitaniketajinkyaashaayeshaamaramitaamolanmol
class                                 TETEBETETEBEBEBETEBE
marks                                               644.99
age                                                    205
dtype: object

In [167]:
df.sum(axis=1, numeric_only=True)

0     79.77
1     82.77
2     98.88
3     93.66
4     88.28
5     75.55
6     91.34
7     99.33
8     85.75
9    109.66
dtype: float64

In [168]:
df.sum(axis=1, numeric_only=True)

0     79.77
1     82.77
2     98.88
3     93.66
4     88.28
5     75.55
6     91.34
7     99.33
8     85.75
9    109.66
dtype: float64

In [169]:
df = pd.read_csv('dataset/student.csv')

In [170]:
df['class'].value_counts()

class
TE    5
BE    5
Name: count, dtype: int64

In [171]:
df['age'].value_counts()

age
20    4
21    2
19    2
22    1
23    1
Name: count, dtype: int64

In [172]:
df.sort_values('class')

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20

In [174]:
df.sort_values(['class', 'marks'])

   roll     name class  marks  age
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
2     3   aniket    BE  76.88   19
9    10    anmol    BE  78.66   21
8     9     amol    TE  56.75   20
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
4     5     asha    TE  63.28   20
3     4  ajinkya    TE  69.66   20

In [175]:
df.sort_values(['marks', 'class'])

   roll     name class  marks  age
5     6   ayesha    BE  49.55   20
8     9     amol    TE  56.75   20
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
3     4  ajinkya    TE  69.66   20
2     3   aniket    BE  76.88   19
9    10    anmol    BE  78.66   21

##### Custom Column Operations

In [177]:
df['marks'] + 0.5

0    57.27
1    60.27
2    77.38
3    70.16
4    63.78
5    50.05
6    65.84
7    68.83
8    57.25
9    79.16
Name: marks, dtype: float64

In [178]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [179]:
df['cgpa'] = df['marks'] / 10 + 0.034

In [180]:
df

   roll     name class  marks  age   cgpa
0     1     anil    TE  56.77   22  5.711
1     2     amit    TE  59.77   21  6.011
2     3   aniket    BE  76.88   19  7.722
3     4  ajinkya    TE  69.66   20  7.000
4     5     asha    TE  63.28   20  6.362
5     6   ayesha    BE  49.55   20  4.989
6     7     amar    BE  65.34   19  6.568
7     8    amita    BE  68.33   23  6.867
8     9     amol    TE  56.75   20  5.709
9    10    anmol    BE  78.66   21  7.900

In [181]:
df['firs_class'] = df['marks'] > 60
df

   roll     name class  marks  age   cgpa  firs_class
0     1     anil    TE  56.77   22  5.711       False
1     2     amit    TE  59.77   21  6.011       False
2     3   aniket    BE  76.88   19  7.722        True
3     4  ajinkya    TE  69.66   20  7.000        True
4     5     asha    TE  63.28   20  6.362        True
5     6   ayesha    BE  49.55   20  4.989       False
6     7     amar    BE  65.34   19  6.568        True
7     8    amita    BE  68.33   23  6.867        True
8     9     amol    TE  56.75   20  5.709       False
9    10    anmol    BE  78.66   21  7.900        True

In [182]:
x = ['M','M','M','M','M','F','M','F','M','M',]

In [183]:
df['gender'] = x
df

   roll     name class  marks  age   cgpa  firs_class gender
0     1     anil    TE  56.77   22  5.711       False      M
1     2     amit    TE  59.77   21  6.011       False      M
2     3   aniket    BE  76.88   19  7.722        True      M
3     4  ajinkya    TE  69.66   20  7.000        True      M
4     5     asha    TE  63.28   20  6.362        True      M
5     6   ayesha    BE  49.55   20  4.989       False      F
6     7     amar    BE  65.34   19  6.568        True      M
7     8    amita    BE  68.33   23  6.867        True      F
8     9     amol    TE  56.75   20  5.709       False      M
9    10    anmol    BE  78.66   21  7.900        True      M

In [185]:
 ndf = pd.DataFrame({
     'roll':range(1,11),
     'cgpa':df['marks'] / 10 + 0.034,
     'gender': ['M','M','M','M','F','M','F','M','M', 'M']
 })

ndf

   roll   cgpa gender
0     1  5.711      M
1     2  6.011      M
2     3  7.722      M
3     4  7.000      M
4     5  6.362      F
5     6  4.989      M
6     7  6.568      F
7     8  6.867      M
8     9  5.709      M
9    10  7.900      M

In [187]:
df = pd.read_csv('dataset/student.csv')

In [188]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [189]:
ndf.columns

Index(['roll', 'cgpa', 'gender'], dtype='object')

In [190]:
df.merge(ndf, on='roll')

   roll     name class  marks  age   cgpa gender
0     1     anil    TE  56.77   22  5.711      M
1     2     amit    TE  59.77   21  6.011      M
2     3   aniket    BE  76.88   19  7.722      M
3     4  ajinkya    TE  69.66   20  7.000      M
4     5     asha    TE  63.28   20  6.362      F
5     6   ayesha    BE  49.55   20  4.989      M
6     7     amar    BE  65.34   19  6.568      F
7     8    amita    BE  68.33   23  6.867      M
8     9     amol    TE  56.75   20  5.709      M
9    10    anmol    BE  78.66   21  7.900      M

In [192]:
df5 = pd.read_csv('dataset/student5.csv')

In [193]:
df5

   roll     name class  marks  age
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [194]:
pd.concat([df,df5])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21
0     1   surbhi    TE  67.44   23
1     2    sujay    TE  74.12   22
2     3  subhash    BE  82.44   21
3     4   sachin    TE  59.33   21
4     5  shalini    TE  63.45   20

In [196]:
pd.concat([df,df5], ignore_index=True)

    roll     name class  marks  age
0      1     anil    TE  56.77   22
1      2     amit    TE  59.77   21
2      3   aniket    BE  76.88   19
3      4  ajinkya    TE  69.66   20
4      5     asha    TE  63.28   20
5      6   ayesha    BE  49.55   20
6      7     amar    BE  65.34   19
7      8    amita    BE  68.33   23
8      9     amol    TE  56.75   20
9     10    anmol    BE  78.66   21
10     1   surbhi    TE  67.44   23
11     2    sujay    TE  74.12   22
12     3  subhash    BE  82.44   21
13     4   sachin    TE  59.33   21
14     5  shalini    TE  63.45   20

##### String Operations

In [202]:
name =  'tushar'

In [203]:
name.lower()

'tushar'

In [204]:
name.upper()

'TUSHAR'

In [205]:
name.capitalize()

'Tushar'

In [206]:
df['name'].str.upper()

0       ANIL
1       AMIT
2     ANIKET
3    AJINKYA
4       ASHA
5     AYESHA
6       AMAR
7      AMITA
8       AMOL
9      ANMOL
Name: name, dtype: object

In [207]:
df['name'].str.endswith('l')

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
9     True
Name: name, dtype: bool

In [211]:
df['name'].str.startswith('an')

0     True
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
Name: name, dtype: bool

In [212]:
df['name'].str.replace('i','ee')

0       aneel
1       ameet
2     aneeket
3    ajeenkya
4        asha
5      ayesha
6        amar
7      ameeta
8        amol
9       anmol
Name: name, dtype: object

In [213]:
df['name'].str.find('i')

0    2
1    2
2    2
3    2
4   -1
5   -1
6   -1
7    2
8   -1
9   -1
Name: name, dtype: int64

In [215]:
df['name'].str.isalpha()

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
8    True
9    True
Name: name, dtype: bool

##### GROUPING AND AGGREGATION

In [217]:
gr = df.groupby('class')

In [218]:
gr.groups

{'BE': [2, 5, 6, 7, 9], 'TE': [0, 1, 3, 4, 8]}

In [219]:
gr.get_group('TE')

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
8     9     amol    TE  56.75   20

In [220]:
gr.min()

       roll     name  marks  age
class
BE        3     amar  49.55   19
TE        1  ajinkya  56.75   20

In [221]:
gr['marks'].max()

class
BE    78.66
TE    69.66
Name: marks, dtype: float64

In [222]:
gr['marks'].min()

class
BE    49.55
TE    56.75
Name: marks, dtype: float64

##### BOOLEAN FILTERING

In [223]:
df['marks'] > 60

0    False
1    False
2     True
3     True
4     True
5    False
6     True
7     True
8    False
9     True
Name: marks, dtype: bool

In [225]:
mask = df['marks'] > 60
df['marks']

0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
6    65.34
7    68.33
8    56.75
9    78.66
Name: marks, dtype: float64

In [226]:
df[df['marks'] > 60]

   roll     name class  marks  age
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [228]:
df[df['name'].str.startswith('an')]

   roll    name class  marks  age
0     1    anil    TE  56.77   22
2     3  aniket    BE  76.88   19
9    10   anmol    BE  78.66   21

In [229]:
x = df[(df['marks'] > 60) & (df['class'] == 'BE')]
x

   roll    name class  marks  age
2     3  aniket    BE  76.88   19
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
9    10   anmol    BE  78.66   21

##### EXPORT THE DATA

In [230]:
X.to_csv('dataset/output.csv', index=False)

In [231]:
x.to_html('dataset/output.html', index=False)